RSN/src/InformationRegisters/ИсторияПередачиМастерданных/ИсторияПередачиМастерданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПередачиМастерданных</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ПередачаМастерданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/СообщенияПередачиМастерданных/СообщенияПередачиМастерданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияПередачиМастерданных</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ПередачаМастерданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МоментВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ИсторияПередачиМастерданных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Перемещает сообщение из очереди на отправку в регистр истории отправки сообщений.
//
// Параметры:
//   Узел - ПланОбменаСсылка.ПередачаМастерданных - узел обмена.
//   МоментВремени - Число - момент времени.
//   Идентификатор - УникальныйИдентификатор - идентификатор сообщения.
//
Процедура ПеренестиСообщениеВИсторию(Узел, МоментВремени, Идентификатор) Экспорт
	
	МенеджерЗаписиОчередь = РегистрыСведений.СообщенияПередачиМастерданных.СоздатьМенеджерЗаписи();
	МенеджерЗаписиОчередь.Узел = Узел;
	МенеджерЗаписиОчередь.МоментВремени = МоментВремени;
	МенеджерЗаписиОчередь.Идентификатор = Идентификатор;
	МенеджерЗаписиОчередь.Прочитать();
	
	Если Не МенеджерЗаписиОчередь.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		МенеджерЗаписиИстория = РегистрыСведений.ИсторияПередачиМастерданных.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиИстория, МенеджерЗаписиОчередь);
		МенеджерЗаписиИстория.ДатаОтправки = ТекущаяДатаСеанса();
		МенеджерЗаписиИстория.Записать(Истина);
		
		МенеджерЗаписиОчередь.Удалить();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
